# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [ 5,6,8,14,15,11]
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v7.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [ -1, 3, C3, [ 1024 ] ],
   [ -1, 1, GAMAttention, [ 1024,1024 ] ], #9
   [ -1, 1, SPPF, [ 1024,5 ] ], #10
  ]

# YOLOv5 v7.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [ -1, 1, CARAFE, [ 512,3,2 ] ],
   [[-1, 6], 1, Concat, [1]],
#   [-1, 3, C3, [512, False]],# 13
   [-1, 3, C3HB, [512]],
   [-1, 1, CBAM, [512]],#15


   [ -1, 1, Conv, [ 512, 1, 1 ] ],
   [ -1, 1, CARAFE, [ 512,3,2 ] ],
   [ [ -1, 4 ], 1, Concat, [ 1 ] ],
#   [ -1, 3, C3, [ 512, False ] ],#17
   [-1, 3, C3HB, [512]],
   [-1, 1, CBAM, [512]],#20


   [-1, 1, Conv, [256, 1, 1]],
   [ -1, 1, CARAFE, [ 256,3,2 ] ],
   [[-1, 2], 1, Concat, [1]],
#   [-1, 3, C3, [256, False]],#21
   [-1, 3, C3HB, [256]],
   [-1, 1, CBAM, [256]],#25


   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 21], 1, Concat, [1]],
#   [-1, 3, C3, [256, False]],#24
   [-1, 3, C3HB, [256]],
   [-1, 1, CBAM, [256]],#29

   [ -1, 1, Conv, [ 256, 3, 2 ] ],
   [ [ -1, 16 ], 1, Concat, [ 1 ] ],
#   [ -1, 3, C3, [ 512, False ] ],#27
   [-1, 3, C3HB, [512]],
   [-1, 1, CBAM, [512]],#33

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],
#   [-1, 3, C3, [1024, False]],#36
   [-1, 3, C3HB, [1024]],

   [[25,29,33,36], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
